var globalTypeCount = {

	//胶带
	'10101': 2,
	'10102': 2,
	'10103': 2,
	'10104': 1,
	'10201': 16,
	'10202': 2,
	'10203': 6,
	'10204': 1,
	'10205': 5,
	'10206': 4,
	'10301': 3,
	'10302': 16,
	'10303': 5,
	'10304': 3,
	'10305': 9,
	'10306': 1, //美纹纸遮蔽膜
	'10401': 13,
	'10501': 4,
	'10502': 1,
	'10601': 5,
	'10602': 2,
	'10603': 1,
	'10604': 1, //和纸遮蔽膜
	'10701': 1,
	'10702': 1,
	'10703': 3,
	'10704': 1,
	'10705': 1,
	'10706': 1,
	'10707': 1,
	'10801': 1,

	//膜材
	'20101': 1,
	'20102': 1,
	'20103': 1
}
var globalData = {
	//BOPP
	//透明胶
	"10101-1": {
		"type": "",            //
		"ncnum": "<a class='search' data-b2bnum='10101-1'>查看</a>",           //nc中的编号
		"name": "水性透明胶",  //产品名称
		"b2bnum": "10101-1",    //b2b平台中的编号
		"isinsale": "是",        //是否在售
		"ncnums": [{
			"name": "透明绿胶带",
			"ncnum": "115"
		}, {
			"name": "透明黄胶带",
			"ncnum": "114"
		}, {
			"name": "透明胶带",
			"ncnum": "111"
		}]
	},
	"10101-2": {
		"type": "",            
		"ncnum": "",           
		"name": "油性透明胶",  
		"b2bnum": "10101-2",
		"isinsale": ""
	},
	//印刷胶带
	"10102-1": {
		"type": "",            
		"ncnum": "100",           
		"name": "水性印刷胶带",  
		"b2bnum": "10102-1",
		"isinsale": "是"  
	},
	"10102-2": {
		"type": "",            
		"ncnum": "",           
		"name": "油性印刷胶带",  
		"b2bnum": "10102-2",
		"isinsale": ""    
	},
	//彩色胶带
	"10103-1": {
		"type": "",            
		"ncnum": "<a class='search' data-b2bnum='10103-1'>查看</a>",           
		"name": "水性彩色胶带",  
		"b2bnum": "10103-1",
		"isinsale": "是",
		"ncnums": [{
			"name": "浅黄",
			"ncnum": "1Y01",
			"rgb": "rgb(255,255,217)"
		}, {
			"name": "中黄",
			"ncnum": "1Y02",
			"rgb": "rgb(255,255,71)"
		}, {
			"name": "柠檬黄",
			"ncnum": "1Y03",
			"rgb": "rgb(255,255,63)"
		}, {
			"name": "铁黄",
			"ncnum": "1Y04",
			"rgb": "rgb(255,195,88)"
		}, {
			"name": "杏黄",
			"ncnum": "1Y05",
			"rgb": "rgb(251,195,148)"
		}, {
			"name": "棕黄",
			"ncnum": "1Y06",
			"rgb": "rgb(227,176,133)"
		}, {
			"name": "浅咖",
			"ncnum": "1Y07",
			"rgb": "rgb(229,176,162)"
		}, {
			"name": "咖啡色",
			"ncnum": "1Y08",
			"rgb": "rgb(200,142,105)"
		}, {
			"name": "金黄",
			"ncnum": "1Y09",
			"rgb": "rgb(238,194,119)"
		}, {
			"name": "石黄",
			"ncnum": "1Y10",
			"rgb": "rgb(220,190,162)"
		}, {
			"name": "沙褐色",
			"ncnum": "1Y11",
			"rgb": "rgb(225,184,138)"
		}, {
			"name": "褐色",
			"ncnum": "1Y12",
			"rgb": "rgb(205,158,106)"
		}, {
			"name": "棕红",
			"ncnum": "1Y13",
			"rgb": "rgb(208,173,145)"
		}, {
			"name": "深棕色",
			"ncnum": "1Y14",
			"rgb": "rgb(180,141,105)"
		}, {
			"name": "骆色",
			"ncnum": "1Y15",
			"rgb": "rgb(185,155,127)"
		}, {
			"name": "赫色",
			"ncnum": "1Y16",
			"rgb": "rgb(145,109,97)"
		}, {
			"name": "灰色",
			"ncnum": "1Y17",
			"rgb": "rgb(187,173,173)"
		}, {
			"name": "淡灰",
			"ncnum": "1Y18",
			"rgb": "rgb(180,170,169)"
		}, {
			"name": "土黄",
			"ncnum": "1Y19",
			"rgb": "rgb(255,123,122)"
		}, {
			"name": "橙色",
			"ncnum": "1Y20",
			"rgb": "rgb(255,187,94)"
		}, {
			"name": "淡玫瑰",
			"ncnum": "1Y21",
			"rgb": "rgb(208,111,182)"
		}, {
			"name": "紫色",
			"ncnum": "1Y22",
			"rgb": "rgb(111,71,141)"
		}, {
			"name": "灰色",
			"ncnum": "1Y23",
			"rgb": "rgb(150,147,166)"
		}, {
			"name": "黑色",
			"ncnum": "1Y24",
			"rgb": "rgb(13,12,20)",
			"color": "rgb(255,255,255)"
		}, {
			"name": "浅桔黄",
			"ncnum": "1Y25",
			"rgb": "rgb(253,133,80)"
		}, {
			"name": "桔黄",
			"ncnum": "1Y26",
			"rgb": "rgb(255,147,90)"
		}, {
			"name": "桔红",
			"ncnum": "1Y27",
			"rgb": "rgb(252,107,80)"
		}, {
			"name": "朱红",
			"ncnum": "1Y28",
			"rgb": "rgb(254,71,75)"
		}, {
			"name": "淡粉色",
			"ncnum": "1Y29",
			"rgb": "rgb(253,208,229)"
		}, {
			"name": "粉红",
			"ncnum": "1Y30",
			"rgb": "rgb(255,180,210)"
		}, {
			"name": "大红",
			"ncnum": "1Y31",
			"rgb": "rgb(255,84,76)"
		}, {
			"name": "鲜红",
			"ncnum": "1Y32",
			"isinsale": "否",
			"rgb": "rgb(255,255,255)"
		}, {
			"name": "草绿色",
			"ncnum": "1Y33",
			"rgb": "rgb(118,237,173)"
		}, {
			"name": "宝绿",
			"ncnum": "1Y34",
			"rgb": "rgb(56,197,145)"
		}, {
			"name": "铁绿",
			"ncnum": "1Y35",
			"isinsale": "否",
			"rgb": "rgb(255,255,255)"
		}, {
			"name": "鲜绿",
			"ncnum": "1Y36",
			"rgb": "rgb(33,171,137)"
		}, {
			"name": "淡绿",
			"ncnum": "1Y37",
			"isinsale": "否",
			"rgb": "rgb(255,255,255)"
		}, {
			"name": "艳绿",
			"ncnum": "1Y38",
			"rgb": "rgb(50,189,88)"
		}, {
			"name": "深蓝",
			"ncnum": "1Y39",
			"rgb": "rgb(46,78,187)"
		}, {
			"name": "浅兰色",
			"ncnum": "1Y40",
			"rgb": "rgb(107,202,248)"
		}, {
			"name": "兰色",
			"ncnum": "1Y41",
			"rgb": "rgb(29,103,202)"
		}, {
			"name": "孔雀蓝",
			"ncnum": "1Y42",
			"isinsale": "否",
			"rgb": "rgb(255,255,255)"
		}, {
			"name": "乳白",
			"ncnum": "1Y43",
			"rgb": "rgb(255,255,255)"
		}, {
			"name": "灰白",
			"ncnum": "1Y44",
			"rgb": "rgb(255,255,255)"
		}, {
			"name": "白杏",
			"ncnum": "1Y45",
			"rgb": "rgb(246,241,238)"
		}] 
	},
	"10103-2": {
		"type": "",            
		"ncnum": "",          
		"name": "油性彩色胶带",  
		"b2bnum": "10103-2",
		"isinsale": ""   
	},
	//文具胶带
	"10104-1": {
		"type": "",        
		"ncnum": "<a class='search' data-b2bnum='10104-1'>查看</a>",         
		"name": "文具胶带",  
		"b2bnum": "10104-1",
		"isinsale": "是",
		"ncnums": [{
			"name": "透明绿文具胶带",
			"ncnum": "197"
		}, {
			"name": "透明黄文具胶带",
			"ncnum": "183"
		}, {
			"name": "透明文具胶带",
			"ncnum": "182"
		}]
	},

	//双面胶
	//棉纸双面胶
	"10201-1": {
		"type": "2321",            //
		"ncnum": "2321",           //nc中的编号
		"name": "热熔棉纸双面胶",  //产品名称
		"b2bnum": "10201-1",    //b2b平台中的编号
		"isinsale": "是"
	},
	"10201-2": {
		"type": "2322",            
		"ncnum": "2322",          
		"name": "热熔棉纸双面胶",  
		"b2bnum": "10201-2",
		"isinsale": ""   
	},
	"10201-3": {
		"type": "2323",            
		"ncnum": "2323",           
		"name": "热熔棉纸双面胶",  
		"b2bnum": "10201-3",
		"isinsale": ""    
	},
	"10201-4": {
		"type": "2221",           
		"ncnum": "2221",        
		"name": "水胶棉纸双面胶",  
		"b2bnum": "10201-4",
		"isinsale": ""  
	},
	"10201-5": {
		"type": "2222",          
		"ncnum": "2222",      
		"name": "水胶棉纸双面胶", 
		"b2bnum": "10201-5",
		"isinsale": ""  
	},
	"10201-6": {
		"type": "2223",          
		"ncnum": "2223",      
		"name": "水胶棉纸双面胶", 
		"b2bnum": "10201-6",
		"isinsale": "是"  
	},
	"10201-7": {
		"type": "2121",          
		"ncnum": "",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-7",
		"isinsale": ""  
	},
	"10201-8": {
		"type": "2122",          
		"ncnum": "",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-8",
		"isinsale": ""  
	},
	"10201-9": {
		"type": "2123",          
		"ncnum": "2123",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-9",
		"isinsale": "是"  
	},
	"10201-10": {
		"type": "2123A",          
		"ncnum": "",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-10",
		"isinsale": ""  
	},
	"10201-11": {
		"type": "2124",          
		"ncnum": "2124",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-11",
		"isinsale": ""  
	},
	"10201-12": {
		"type": "2124P",          
		"ncnum": "",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-12",
		"isinsale": ""  
	},
	"10201-13": {
		"type": "2125",          
		"ncnum": "",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-13",
		"isinsale": ""  
	},
	"10201-14": {
		"type": "2126",          
		"ncnum": "2126",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-14",
		"isinsale": ""  
	},
	"10201-15": {
		"type": "2127",          
		"ncnum": "2127",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-15",
		"isinsale": ""  
	},
	"10201-16": {
		"type": "2127A",          
		"ncnum": "",      
		"name": "油胶棉纸双面胶", 
		"b2bnum": "10201-16",
		"isinsale": ""  
	},
	//PE泡棉双面胶
	"10202-1": {
		"type": "2331",          
		"ncnum": "2331",      
		"name": "热熔PE泡棉双面胶", 
		"b2bnum": "10202-1",
		"isinsale": "是"  
	},
	"10202-2": {
		"type": "2331H",          
		"ncnum": "",      
		"name": "热熔PE泡棉双面胶（加粘）", 
		"b2bnum": "10202-2",
		"isinsale": ""  
	},
	//EVA泡棉双面胶
	"10203-1": {
		"type": "2391",          
		"ncnum": "",      
		"name": "热熔EVA泡棉双面胶", 
		"b2bnum": "10203-1",
		"isinsale": "是"  
	},
	"10203-2": {
		"type": "2331",          
		"ncnum": "",      
		"name": "水胶EVA泡棉双面胶", 
		"b2bnum": "10203-2",
		"isinsale": ""  
	},
	"10203-3": {
		"type": "2293W",          
		"ncnum": "",      
		"name": "水胶EVA泡棉双面胶", 
		"b2bnum": "10203-3",
		"isinsale": ""  
	},
	"10203-4": {
		"type": "2193",          
		"ncnum": "",      
		"name": "油胶EVA泡棉双面胶", 
		"b2bnum": "10203-4",
		"isinsale": ""  
	},
	"10203-5": {
		"type": "2194R",          
		"ncnum": "",      
		"name": "油胶EVA泡棉双面胶", 
		"b2bnum": "10203-5",
		"isinsale": ""  
	},
	"10203-6": {
		"type": "",          
		"ncnum": "",      
		"name": "挂钩泡棉", 
		"b2bnum": "10203-6",
		"isinsale": ""  
	},
	//布基双面胶
	"10204-1": {
		"type": "",          
		"ncnum": "",      
		"name": "热熔布基双面胶", 
		"b2bnum": "10204-1",
		"isinsale": ""  
	},
	//汽车泡棉双面胶
	"10205-1": {
		"type": "2177G",          
		"ncnum": "",      
		"name": "绿色汽车泡棉双面胶", 
		"b2bnum": "10205-1",
		"isinsale": ""  
	},
	"10205-2": {
		"type": "2177B",          
		"ncnum": "",      
		"name": "蓝色汽车泡棉双面胶", 
		"b2bnum": "10205-2",
		"isinsale": ""  
	},
	"10205-3": {
		"type": "2177R",          
		"ncnum": "",      
		"name": "红色汽车泡棉双面胶", 
		"b2bnum": "10205-3",
		"isinsale": ""  
	},
	"10205-4": {
		"type": "2177C",          
		"ncnum": "",      
		"name": "橙色汽车泡棉双面胶", 
		"b2bnum": "10205-4",
		"isinsale": ""  
	},
	"10205-5": {
		"type": "2174R",          
		"ncnum": "",      
		"name": "红色汽车泡棉双面胶", 
		"b2bnum": "10205-5",
		"isinsale": "是"
	},
	//薄膜双面胶
	"10206-1": {
		"type": "2114",          
		"ncnum": "",      
		"name": "油胶薄膜双面胶", 
		"b2bnum": "10206-1",
		"isinsale": "是"  
	},
	"10206-2": {
		"type": "2144",          
		"ncnum": "2144",      
		"name": "油胶薄膜双面胶", 
		"b2bnum": "10206-2",
		"isinsale": ""  
	},
	"10206-3": {
		"type": "2117",          
		"ncnum": "",      
		"name": "油胶薄膜双面胶", 
		"b2bnum": "10206-3",
		"isinsale": ""  
	},
	"10206-4": {
		"type": "2117A",          
		"ncnum": "",      
		"name": "油胶薄膜双面胶", 
		"b2bnum": "10206-4",
		"isinsale": ""  
	},
	//美纹纸
	//条纹美纹纸
	"10301-1": {
		"type": "323A",          
		"ncnum": "323A",      
		"name": "条纹美纹纸", 
		"b2bnum": "10301-1",
		"isinsale": "是"  
	},
	"10301-2": {
		"type": "363A",          
		"ncnum": "363A",      
		"name": "条纹美纹纸", 
		"b2bnum": "10301-2",
		"isinsale": ""  
	},
	"10301-3": {
		"type": "355A",          
		"ncnum": "",      
		"name": "条纹美纹纸", 
		"b2bnum": "10301-3",
		"isinsale": ""  
	},
	//平纹美纹纸
	"10302-1": {
		"type": "323M",          
		"ncnum": "323M",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-1",
		"isinsale": "是"  
	},
	"10302-2": {
		"type": "363M",          
		"ncnum": "363M",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-2",
		"isinsale": ""  
	},
	"10302-3": {
		"type": "373M",          
		"ncnum": "373M",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-3",
		"isinsale": ""  
	},
	"10302-4": {
		"type": "323H",          
		"ncnum": "323H",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-4",
		"isinsale": ""  
	},
	"10302-5": {
		"type": "363H",          
		"ncnum": "363H",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-5",
		"isinsale": ""  
	},
	"10302-6": {
		"type": "373H",          
		"ncnum": "373H",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-6",
		"isinsale": ""  
	},
	"10302-7": {
		"type": "323HH",          
		"ncnum": "323HH",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-7",
		"isinsale": "是"  
	},
	"10302-8": {
		"type": "363HH",          
		"ncnum": "",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-8",
		"isinsale": ""  
	},
	"10302-9": {
		"type": "323L",          
		"ncnum": "323L",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-9",
		"isinsale": ""  
	},
	"10302-10": {
		"type": "363L",          
		"ncnum": "363L",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-10",
		"isinsale": ""  
	},
	"10302-11": {
		"type": "373W",          
		"ncnum": "373W",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-11",
		"isinsale": ""  
	},
	"10302-12": {
		"type": "355M",          
		"ncnum": "355M",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-12",
		"isinsale": ""  
	},
	"10302-13": {
		"type": "383",          
		"ncnum": "383",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-13",
		"isinsale": ""  
	},
	"10302-14": {
		"type": "355H",          
		"ncnum": "",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-14",
		"isinsale": ""  
	},
	"10302-15": {
		"type": "383A",          
		"ncnum": "383A",      
		"name": "平纹美纹纸", 
		"b2bnum": "10302-15",
		"isinsale": ""  
	},
	//耐温美纹纸
	"10303-1": {
		"type": "309",          
		"ncnum": "309",      
		"name": "耐温美纹纸", 
		"b2bnum": "10303-1",
		"isinsale": "是"  
	},
	"10303-2": {
		"type": "358",          
		"ncnum": "358",      
		"name": "耐温美纹纸", 
		"b2bnum": "10303-2",
		"isinsale": ""  
	},
	"10303-3": {
		"type": "378",          
		"ncnum": "378",      
		"name": "耐温美纹纸", 
		"b2bnum": "10303-3",
		"isinsale": ""  
	},
	"10303-4": {
		"type": "3502",          
		"ncnum": "",      
		"name": "耐温美纹纸", 
		"b2bnum": "10303-4",
		"isinsale": ""  
	},
	"10303-5": {
		"type": "3505",          
		"ncnum": "",      
		"name": "耐温美纹纸", 
		"b2bnum": "10303-5",
		"isinsale": ""  
	},
	//水性美纹纸
	"10304-1": {
		"type": "325",          
		"ncnum": "325",      
		"name": "水性美纹纸", 
		"b2bnum": "10304-1",
		"isinsale": ""  
	},
	"10304-2": {
		"type": "326",          
		"ncnum": "326",      
		"name": "水性美纹纸", 
		"b2bnum": "10304-2",
		"isinsale": "是"  
	},
	"10304-3": {
		"type": "327",          
		"ncnum": "327",      
		"name": "水性美纹纸", 
		"b2bnum": "10304-3",
		"isinsale": ""  
	},
	//矽利康美纹纸
	"10305-1": {
		"type": "618",          
		"ncnum": "618",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-1",
		"isinsale": ""  
	},
	"10305-2": {
		"type": "628",          
		"ncnum": "628",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-2",
		"isinsale": ""  
	},
	"10305-3": {
		"type": "638",          
		"ncnum": "638",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-3",
		"isinsale": ""  
	},
	"10305-4": {
		"type": "658",          
		"ncnum": "658",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-4",
		"isinsale": ""  
	},
	"10305-5": {
		"type": "658A",          
		"ncnum": "658A",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-5",
		"isinsale": "是"  
	},
	"10305-6": {
		"type": "668",          
		"ncnum": "668",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-6",
		"isinsale": ""  
	},
	"10305-7": {
		"type": "668A",          
		"ncnum": "668A",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-7",
		"isinsale": ""  
	},
	"10305-8": {
		"type": "678",          
		"ncnum": "678",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-8",
		"isinsale": ""  
	},
	"10305-9": {
		"type": "678A",          
		"ncnum": "",      
		"name": "矽利康美纹纸", 
		"b2bnum": "10305-9",
		"isinsale": ""  
	},
	//美纹纸遮蔽膜
	"10306-1": {
		"type": "",          
		"ncnum": "",      
		"name": "美纹纸遮蔽膜胶带", 
		"b2bnum": "10306-1",
		"isinsale": ""  
	},

	//牛皮纸胶带
	"10401-1": {
		"type": "410",          
		"ncnum": "410",      
		"name": "白色橡胶牛皮胶带", 
		"b2bnum": "10401-1",
		"isinsale": ""  
	},
	"10401-2": {
		"type": "400H",          
		"ncnum": "400H",      
		"name": "本色橡胶牛皮胶带", 
		"b2bnum": "10401-2",
		"isinsale": "是"  
	},
	"10401-3": {
		"type": "400-1",          
		"ncnum": "400-1",      
		"name": "本色橡胶牛皮胶带", 
		"b2bnum": "10401-3",
		"isinsale": ""  
	},
	"10401-4": {
		"type": "400F",          
		"ncnum": "400F",      
		"name": "分层橡胶牛皮胶带", 
		"b2bnum": "10401-4",
		"isinsale": ""  
	},
	"10401-5": {
		"type": "413",          
		"ncnum": "413",      
		"name": "本色油胶牛皮胶带", 
		"b2bnum": "10401-5",
		"isinsale": ""  
	},
	"10401-6": {
		"type": "418",          
		"ncnum": "418",      
		"name": "本色油胶牛皮胶带", 
		"b2bnum": "10401-6",
		"isinsale": "是"  
	},
	"10401-7": {
		"type": "424",          
		"ncnum": "424",      
		"name": "本色水胶牛皮胶带", 
		"b2bnum": "10401-7",
		"isinsale": ""  
	},
	"10401-8": {
		"type": "436",          
		"ncnum": "436",      
		"name": "本色热熔牛皮胶带", 
		"b2bnum": "10401-8",
		"isinsale": ""  
	},
	"10401-9": {
		"type": "437",          
		"ncnum": "437",      
		"name": "本色热熔牛皮胶带", 
		"b2bnum": "10401-9",
		"isinsale": ""  
	},
	"10401-10": {
		"type": "438",          
		"ncnum": "438",      
		"name": "白色热熔牛皮胶带", 
		"b2bnum": "10401-10",
		"isinsale": ""  
	},
	"10401-11": {
		"type": "439",          
		"ncnum": "439",      
		"name": "分层热熔牛皮胶带", 
		"b2bnum": "10401-11",
		"isinsale": "是"  
	},
	"10401-12": {
		"type": "435-1",          
		"ncnum": "435-1",      
		"name": "本色热熔牛皮胶带", 
		"b2bnum": "10401-12",
		"isinsale": ""  
	},
	"10401-13": {
		"type": "435-2",          
		"ncnum": "435-2",      
		"name": "本色橡胶牛皮胶带", 
		"b2bnum": "10401-13",
		"isinsale": "是"  
	},

	//布基胶
	//普通布基胶
	"10501-1": {
		"type": "530A",          
		"ncnum": "530A",      
		"name": "热熔布基胶带", 
		"b2bnum": "10501-1",
		"isinsale": ""  
	},
	"10501-2": {
		"type": "530B",          
		"ncnum": "530B",      
		"name": "热熔布基胶带", 
		"b2bnum": "10501-2",
		"isinsale": "是"  
	},
	"10501-3": {
		"type": "530C",          
		"ncnum": "",      
		"name": "热熔布基胶带", 
		"b2bnum": "10501-3",
		"isinsale": ""  
	},
	"10501-4": {
		"type": "522",          
		"ncnum": "522",      
		"name": "橡胶布基胶带", 
		"b2bnum": "10501-4",
		"isinsale": ""  
	},
	//醋酸布胶带
	"10502-1": {
		"type": "523",          
		"ncnum": "523",      
		"name": "醋酸布胶带", 
		"b2bnum": "10502-1",
		"isinsale": "是"  
	},

	//和纸胶带
	//水性和纸胶带
	"10601-1": {
		"type": "7288",          
		"ncnum": "7288",      
		"name": "水胶和纸胶带", 
		"b2bnum": "10601-1",
		"isinsale": "是"  
	},
	"10601-2": {
		"type": "7388",          
		"ncnum": "7388",      
		"name": "水胶和纸胶带", 
		"b2bnum": "10601-2",
		"isinsale": ""  
	},
	"10601-3": {
		"type": "7288J",          
		"ncnum": "7288J",      
		"name": "水胶和纸胶带", 
		"b2bnum": "10601-3",
		"isinsale": ""  
	},
	"10601-4": {
		"type": "7588",          
		"ncnum": "7588",      
		"name": "水胶和纸胶带", 
		"b2bnum": "10601-4",
		"isinsale": ""  
	},
	"10601-5": {
		"type": "7588J",          
		"ncnum": "7588J",      
		"name": "水胶和纸胶带", 
		"b2bnum": "10601-5",
		"isinsale": ""  
	},
	//油性和纸胶带
	"10602-1": {
		"type": "7688",          
		"ncnum": "7688",      
		"name": "油胶和纸胶带", 
		"b2bnum": "10602-1",
		"isinsale": "是"  
	},
	"10602-2": {
		"type": "7988",          
		"ncnum": "7988",      
		"name": "油胶和纸胶带", 
		"b2bnum": "10602-2",
		"isinsale": "是"  
	},
	//彩印和纸胶带
	"10603-1": {
		"type": "7288",          
		"ncnum": "7288",      
		"name": "彩印水胶和纸胶带", 
		"b2bnum": "10603-1",
		"isinsale": ""  
	},
	//和纸遮蔽膜
	"10604-1": {
		"type": "",          
		"ncnum": "",      
		"name": "和纸遮蔽膜胶带", 
		"b2bnum": "10604-1",
		"isinsale": ""  
	},

	//特种胶带
	//绿硅胶
	"10701-1": {
		"type": "",          
		"ncnum": "8727",      
		"name": "绿硅胶带", 
		"b2bnum": "10701-1",
		"isinsale": ""  
	},
	//电工胶
	"10702-1": {
		"type": "",          
		"ncnum": "861",      
		"name": "电工胶带", 
		"b2bnum": "10702-1",
		"isinsale": "是"  
	},
	//警示胶
	"10703-1": {
		"type": "",          
		"ncnum": "852",      
		"name": "单色警示胶带", 
		"b2bnum": "10703-1",
		"isinsale": "是"  
	},
	"10703-2": {
		"type": "",          
		"ncnum": "853",      
		"name": "双色警示胶带", 
		"b2bnum": "10703-2",
		"isinsale": "是"  
	},
	//镭射膜胶带
	"10704-1": {
		"type": "",          
		"ncnum": "855",      
		"name": "镭射膜胶带", 
		"b2bnum": "10704-1",
		"isinsale": "是"  
	},
	//免刀胶带
	"10705-1": {
		"type": "",          
		"ncnum": "812",      
		"name": "免刀胶带", 
		"b2bnum": "10705-1",
		"isinsale": "是"  
	},
	//金手指胶带
	"10706-1": {
		"type": "",          
		"ncnum": "",      
		"name": "金手指胶带", 
		"b2bnum": "10706-1",
		"isinsale": ""  
	},
	//铝箔胶带
	"10707-1": {
		"type": "",          
		"ncnum": "",      
		"name": "铝箔胶带", 
		"b2bnum": "10707-1",
		"isinsale": ""  
	},


	//胶带配件
	//胶带切割器
	"10801-1": {
		"type": "",          
		"ncnum": "",      
		"name": "胶带切割器", 
		"b2bnum": "10801-1",
		"isinsale": ""  
	},

	//膜材
	//缠绕膜
	"20101-1": {
		"type": "",
		"ncnum": "",      
		"name": "手用缠绕膜", 
		"b2bnum": "20101-1",
		"isinsale": "是"  
	},
	"20102-1": {
		"type": "",
		"ncnum": "",      
		"name": "机用缠绕膜", 
		"b2bnum": "20102-1",
		"isinsale": "是"  
	},

}